var data = [];
var dataStr = '1、美国往事<br>\
<br>\
导演: 赛尔乔·莱翁内<br>\
编剧: 皮耶罗·德·伯纳迪 / 恩里科·梅迪欧力 / 弗兰科·费里尼 / 赛尔乔·莱翁内<br>\
主演: 罗伯特·德尼罗 / 詹姆斯·伍兹 / 伊丽莎白·麦戈文 / 乔·佩西 / 波特·杨<br>\
类型: 剧情 / 犯罪<br>\
制片国家/地区: 意大利 / 美国<br>\
语言: 英语 / 法语 / 意大利语<br>\
上映日期: 1984-02-17(波士顿首映) / 1984-09-28(意大利)<br>\
片长: 229分钟(导演剪辑版) / 251分钟(导演剪辑加长版)<br>\
<br>\
<br>\
2、天堂电影院<br>\
<br>\
导演: 朱塞佩·托纳多雷<br>\
编剧: Carl / 朱塞佩·托纳多雷<br>\
主演: 安东娜拉·塔莉 / 恩佐·卡拉瓦勒 / 艾萨·丹尼埃利 / 里奥·故罗塔 / 马克·莱昂纳蒂<br>\
类型: 剧情 / 爱情<br>\
制片国家/地区: 意大利 / 法国<br>\
语言: 意大利语 / 英语 / 葡萄牙语<br>\
上映日期: 1988-11-17(意大利)<br>\
片长: 155分钟 / 173分钟(加长版) / 124分钟(公映版)<br>\
<br>\
<br>\
3、闻香识女人<br>\
<br>\
导演: 马丁·布莱斯<br>\
编剧: 博·古德曼 / 乔瓦尼·阿尔皮诺<br>\
主演: 阿尔·帕西诺 / 克里斯·奥唐纳 / 詹姆斯·瑞布霍恩 / 加布里埃尔·安瓦尔 / 菲利普·塞默·霍夫曼<br>\
类型: 剧情<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 1992-12-23(美国)<br>\
片长: 157 分钟<br>\
<br>\
<br>\
4、放牛班的春天<br>\
<br>\
导演: 克里斯托夫·巴拉蒂<br>\
编剧: Georges Chaperot / 勒·惠勒<br>\
主演: 杰拉尔·朱诺 / 让-巴蒂斯特·莫尼耶 / 弗朗索瓦·贝利昂 / 凯德·麦拉德 / 玛丽·布奈尔 / 更多...<br>\
类型: 剧情 / 音乐<br>\
制片国家/地区: 法国 / 瑞士 / 德国<br>\
语言: 法语<br>\
上映日期: 2004-10-16(中国大陆) / 2004-03-17(法国)<br>\
片长: 97 分钟<br>\
<br>\
<br>\
5、海上钢琴师<br>\
<br>\
导演: 朱塞佩·托纳多雷<br>\
编剧: 亚利桑德罗·巴里克 / 朱塞佩·托纳多雷<br>\
主演: 蒂姆·罗斯 / 普路特·泰勒·文斯 / 比尔·努恩 / 梅兰尼·蒂埃里 / 阿尔贝托·巴斯克斯<br>\
类型: 剧情 / 音乐<br>\
制片国家/地区: 意大利<br>\
语言: 英语 / 法语<br>\
上映日期: 1998-10-28(意大利)<br>\
片长: 165分钟 / 120分钟(法国版) / 169分钟(加长版)<br>\
<br>\
<br>\
6、黄金三镖客<br>\
<br>\
导演：赛尔乔·莱翁内<br>\
编剧: 艾根诺尔·因克鲁西 / 富里奥·斯卡派利 / 卢西亚诺·文森佐尼 / 赛尔乔·莱翁内<br>\
主演: 克林特·伊斯特伍德 / 埃里·瓦拉赫 / 李·范·克里夫 / 阿尔多·久弗瑞 / 路易吉·皮斯蒂利<br>\
类型: 西部 / 冒险<br>\
制片国家/地区: 意大利 / 西班牙 / 西德<br>\
语言: 意大利语 / 英语<br>\
上映日期: 1966-12-23<br>\
片长: 161 分钟 / 186 分钟(法国加长版) / 182 分钟(西班牙) / 179 分钟(美国加长版)<br>\
<br>\
<br>\
7、低俗小说<br>\
<br>\
导演: 昆汀·塔伦蒂诺<br>\
编剧: 昆汀·塔伦蒂诺 / 罗杰·阿夫瑞<br>\
主演: 约翰·特拉沃尔塔 / 乌玛·瑟曼 / 阿曼达·普拉莫 / 蒂姆·罗斯 / 塞缪尔·杰克逊<br>\
类型: 剧情 / 喜剧 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 西班牙语 / 法语<br>\
上映日期: 1994-05-12(戛纳电影节) / 1994-10-14(美国)<br>\
片长: 154分钟<br>\
<br>\
<br>\
8、教父<br>\
<br>\
导演: 布莱恩·辛格<br>\
编剧: 克里斯托弗·麦奎里<br>\
主演: 史蒂芬·鲍德温 / 加布里埃尔·伯恩 / 本尼西奥·德尔·托罗 / 凯文·波拉克 / 凯文·史派西<br>\
类型: 剧情 / 悬疑 / 惊悚 / 犯罪<br>\
制片国家/地区: 德国 / 美国<br>\
语言: 英语 / 匈牙利语 / 西班牙语 / 法语<br>\
上映日期: 1995-01-25(圣丹斯电影节) / 1995-09-15(美国)<br>\
片长: 106分钟<br>\
<br>\
<br>\
9、非常嫌疑犯<br>\
<br>\
导演: 布莱恩·辛格<br>\
编剧: 克里斯托弗·麦奎里<br>\
主演: 史蒂芬·鲍德温 / 加布里埃尔·伯恩 / 本尼西奥·德尔·托罗 / 凯文·波拉克 / 凯文·史派西<br>\
类型: 剧情 / 悬疑 / 惊悚 / 犯罪<br>\
制片国家/地区: 德国 / 美国<br>\
语言: 英语 / 匈牙利语 / 西班牙语 / 法语<br>\
上映日期: 1995-01-25(圣丹斯电影节) / 1995-09-15(美国)<br>\
片长: 106分钟<br>\
<br>\
<br>\
10、飞越疯人院<br>\
<br>\
导演: 米洛斯·福尔曼<br>\
编剧: 劳伦斯·奥邦 / 博·古德曼<br>\
主演: 杰克·尼科尔森 / 丹尼·德维托 / 克里斯托弗·洛伊德 / 路易丝·弗莱彻 / 特德·马克兰德 / 更多...<br>\
类型: 剧情<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 1975-11-21(美国)<br>\
片长: 133分钟<br>\
<br>\
<br>\
11、肖申克的救赎<br>\
<br>\
导演: 弗兰克·德拉邦特<br>\
编剧: 弗兰克·德拉邦特 / 斯蒂芬·金<br>\
主演: 蒂姆·罗宾斯 / 摩根·弗里曼 / 鲍勃·冈顿 / 威廉姆·赛德勒 / 克兰西·布朗<br>\
类型: 剧情 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 1994-09-10(多伦多电影节) / 1994-10-14(美国)<br>\
片长: 142 分钟<br>\
<br>\
<br>\
12、杀死比尔<br>\
<br>\
导演: 昆汀·塔伦蒂诺<br>\
编剧: 昆汀·塔伦蒂诺 / 乌玛·瑟曼<br>\
主演: 乌玛·瑟曼 / 刘玉玲 / 薇薇卡·福克斯 / 达丽尔·汉纳 / 大卫·卡拉丁<br>\
类型: 动作 / 惊悚 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 日语 / 法语<br>\
上映日期: 2003-10-10(美国)<br>\
片长: 111分钟<br>\
<br>\
<br>\
13、无耻混蛋<br>\
<br>\
导演: 昆汀·塔伦蒂诺<br>\
编剧: 昆汀·塔伦蒂诺<br>\
主演: 布拉德·皮特 / 梅拉尼·罗兰 / 克里斯托弗·沃尔兹 / 伊莱·罗斯 / 迈克尔·法斯宾德<br>\
类型: 剧情 / 犯罪<br>\
制片国家/地区: 美国 / 德国<br>\
语言: 英语 / 德语 / 法语 / 意大利语<br>\
上映日期: 2009-08-20(德国)<br>\
片长: 153分钟 <br>\
<br>\
<br>\
14、两杆大烟枪<br>\
<br>\
导演: 盖·里奇<br>\
编剧: 盖·里奇<br>\
主演: 杰森·弗莱明 / 德克斯特·弗莱彻 / 尼克·莫兰 / 杰森·斯坦森 / 斯蒂文·麦金托什<br>\
类型: 剧情 / 喜剧 / 犯罪<br>\
制片国家/地区: 英国<br>\
语言: 英语<br>\
上映日期: 1998-08-28(英国)<br>\
片长: 107分钟 / 120分钟(导演剪辑版)<br>\
<br>\
<br>\
15、落水狗<br>\
<br>\
导演: 昆汀·塔伦蒂诺<br>\
编剧: 昆汀·塔伦蒂诺 / 罗杰·阿夫瑞<br>\
主演: 哈威·凯特尔 / 蒂姆·罗斯 / 迈克尔·马德森 / 克里斯·潘 / 史蒂夫·布西密<br>\
类型: 惊悚 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 1992-01-21(圣丹斯电影节)<br>\
片长: 99 分钟<br>\
<br>\
<br>\
16、让子弹飞<br>\
<br>\
导演: 姜文<br>\
编剧: 朱苏进 / 述平 / 姜文 / 郭俊立 / 危笑 / 李不空 / 马识途<br>\
主演: 姜文 / 葛优 / 周润发 / 刘嘉玲 / 陈坤<br>\
类型: 剧情 / 喜剧 / 动作 / 西部<br>\
制片国家/地区: 中国大陆 / 香港<br>\
语言: 汉语普通话 / 四川话 / 山西话<br>\
上映日期: 2010-12-16(中国大陆)<br>\
片长: 132分钟<br>\
';


var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
  var c = d[i].split('<br><br>');
  data.push({
    img: c[0].replace('、', '-') + '.jpg',
    caption: c[0].split('、')[1],
    desc: c[1]
  });
  // console.log(data[i].img);
}